//count of the 0 at the end of N Factorial
//քանի որ N բնական թվի ֆակտորիալի մեջ 2֊ի բազմապատիկները միշտ ավելի շատ են,
//քան 5֊ի բազմապատիկները, նշանակում է նրա վերջում 0֊ների քանակը կախված է միայն
//5֊ի բազմապատիկների քանակից։ Դրա համար մենք կհաշվենք միայն 5֊ի բազմապատիկների քանակը։
#include <iostream>
using namespace std;

int main(){
  int n=-1;
  while (n<0){
    cout << "Ներմուծել n բնական թիվը" << endl;
    cin >> n;
  }
  int count = 0;
  int num5 = 5;
  while ((n/num5)>0){
    count += (n/num5);
    num5 *=5;
  }
  cout << "0-ների քանաը " << n << " թվի ֆակտորիալի վերջում հավասար է՝ "<< count << endl;
}
